InformationRegisters/Б24_К_ИдентификаторыДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_К_ИдентификаторыДел</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_К_ИдентификаторыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_К_ИдентификаторыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Б24_К_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Б24_К_НастройкиПодключения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийВебхук</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружатьАдресаРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗагружатьАдресаРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДелаБитрикс24</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбсужденияВЧатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьПользователейБитрикс24ОбОшибках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонияБитрикс24</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспортПечатныхФормОтчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиДанныхОбОшибках</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователяБитрикс24</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрыСообщенийОбОшибках</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючевойТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченияНаВыгрузкуДелСозданныхПоОснованию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПресетыШаблоновРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеШаблона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдШаблона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПресетыСтавокНДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтавкиНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтавки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиКлиентовОтТиповКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПресетыТиповКлиентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКлиента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрочиеОтношения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конкурент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Б24_К_ИдентификаторыДел/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область РаботаСИдентификаторамиБитрикс24
                 
Процедура ЗаписатьИдБ24Объекта(СтруктураНастроек, ТипДанных, Данные, ИдБитрикс24, ДополнительныйИдБитрикс24="") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдБитрикс24) И НЕ ЗначениеЗаполнено(ДополнительныйИдБитрикс24) Тогда
		Возврат;
	КонецЕсли;  

	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Объект = Данные.Объект;	
	Иначе
		Объект = Данные;	
	КонецЕсли;
	
	Если Объект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ИдБитрикс24, "Да") > 0 Тогда        // когда вместо id возращается true - пропускается запись
		Возврат;
	КонецЕсли;
	
	Идентификатор 		= Формат(ИдБитрикс24, "ЧГ=0");	
	ДопИдентификатор 	= Формат(ДополнительныйИдБитрикс24, "ЧГ=0");	

	//ПрефиксыВнешнихКодовБитрикс24 = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьПрефиксВнешнихКодовБитрикс24();
	//Для каждого ТекКлюч Из ПрефиксыВнешнихКодовБитрикс24 Цикл           
	//	
	//	ДлинаПрефикса = СтрДлина(ТекКлюч.Значение);	     
	//	
	//	Если Лев(ДопИдентификатор, ДлинаПрефикса) = ТекКлюч.Значение Тогда
	//		ДопИдентификатор = Прав(ДопИдентификатор, СтрДлина(ДопИдентификатор) - ДлинаПрефикса); 
	//		Прервать;
	//	КонецЕсли; 
	//	
	//КонецЦикла;
	
	НоваяЗапись = РегистрыСведений.Б24_К_ИдентификаторыОбъектов.СоздатьМенеджерЗаписи();   
	
	НоваяЗапись.ТипДанных 					= ТипДанных;
	НоваяЗапись.Портал 						= СтруктураНастроек.Портал;  
	//НоваяЗапись.ТипОбъекта 				= Объект.Метаданные().ПолноеИмя();
	НоваяЗапись.Объект						= Объект;
	
	НоваяЗапись.Идентификатор 				= Идентификатор;
	НоваяЗапись.ДополнительныйИдентификатор = ДопИдентификатор;
	
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИдБ24Объекта(СтруктураНастроек, ТипДанных, Объект) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта 				= Объект.Метаданные().ПолноеИмя();
	ИдентификаторОбъекта	= XMLСтрока(Объект);
	
	Выборка = РегистрыСведений.Б24_К_ИдентификаторыДел.Выбрать(Новый Структура("ИдентификаторОбъекта", ИдентификаторОбъекта));
	Пока Выборка.Следующий() Цикл     
		Если Выборка.ТипДанных = ТипДанных И Выборка.ТипОбъекта = ТипОбъекта И Выборка.Портал = СтруктураНастроек.Портал Тогда
			ОписаниеОбъекта = ТипОбъекта + "||" + ИдентификаторОбъекта;
			Б24_К_ОбщегоНазначенияВызовСервера.ДобавитьВЛог(СтруктураНастроек,  СтруктураНастроек.ТипыСообщений.Ошибка, "Удален id для объекта:" + ОписаниеОбъекта + ". Тип объекта:" + Строка(ТипДанных));
			Выборка.ПолучитьМенеджерЗаписи().Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдОбъекта(Портал, ТипДанных, ОбъектСсылка) Экспорт  
	
	ТипОбъекта 				= ОбъектСсылка.Метаданные().ПолноеИмя();
	ИдентификаторОбъекта	= XMLСтрока(ОбъектСсылка); 
	
	СтруктураОтбора = Новый Структура;      
	СтруктураОтбора.Вставить("ТипДанных"			, ТипДанных);
	СтруктураОтбора.Вставить("Портал"				, Портал);
	СтруктураОтбора.Вставить("ТипОбъекта"			, ТипОбъекта);
	СтруктураОтбора.Вставить("ИдентификаторОбъекта"	, ИдентификаторОбъекта);
	
	Возврат РегистрыСведений.Б24_К_ИдентификаторыДел.Получить(СтруктураОтбора).Идентификатор;
	
КонецФункции

Функция ПолучитьДопИдОбъекта(Портал, ТипДанных, ОбъектСсылка) Экспорт
	
	ТипОбъекта 				= ОбъектСсылка.Метаданные().ПолноеИмя();
	ИдентификаторОбъекта	= XMLСтрока(ОбъектСсылка); 
	
	СтруктураОтбора = Новый Структура;      
	СтруктураОтбора.Вставить("ТипДанных"			, ТипДанных);
	СтруктураОтбора.Вставить("Портал"				, Портал);
	СтруктураОтбора.Вставить("ТипОбъекта"			, ТипОбъекта);
	СтруктураОтбора.Вставить("ИдентификаторОбъекта"	, ИдентификаторОбъекта);
	            
	Возврат РегистрыСведений.Б24_К_ИдентификаторыДел.Получить(СтруктураОтбора).ДополнительныйИдентификатор;
	
КонецФункции


Функция ПолучитьЗначениеПоИдБ24Объекта(Портал, ТипДанных, ИдБитрикс24) Экспорт

	Результат = Неопределено;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Портал"			, Портал);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("Идентификатор"	, ИдБитрикс24);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыДел.ТипОбъекта КАК ТипОбъекта,
	|	Б24_К_ИдентификаторыДел.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыДел КАК Б24_К_ИдентификаторыДел
	|ГДЕ
	|	Б24_К_ИдентификаторыДел.Портал = &Портал
	|	И Б24_К_ИдентификаторыДел.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыДел.Идентификатор = &Идентификатор";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		Выборка.Следующий();
		
		Результат  = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоИмениИИдентификатору(Выборка.ТипОбъекта, Выборка.ИдентификаторОбъекта);	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеПоДопИдБ24Объекта(Портал, ТипДанных, ДопИдБитрикс24) Экспорт
	
	Результат = Неопределено;
	
	ДопИдентификатор 	= Формат(ДопИдБитрикс24, "ЧГ=0");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Портал"			, Портал);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("ДопИдентификатор", ДопИдентификатор);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыДел.ТипОбъекта КАК ТипОбъекта,
	|	Б24_К_ИдентификаторыДел.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыДел КАК Б24_К_ИдентификаторыДел
	|ГДЕ
	|	Б24_К_ИдентификаторыДел.Портал = &Портал
	|	И Б24_К_ИдентификаторыДел.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыДел.ДополнительныйИдентификатор = &ДопИдентификатор";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		Выборка.Следующий();
		
		Результат = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоИмениИИдентификатору(Выборка.ТипОбъекта, Выборка.ИдентификаторОбъекта); 		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьМассивЗначенийПоИдБ24Объекта(Портал, ТипДанных, ИдБитрикс24) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Портал"			, Портал);
	Запрос.УстановитьПараметр("ТипДанных"		, ТипДанных);
	Запрос.УстановитьПараметр("Идентификатор"	, ИдБитрикс24);
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыДел.ТипОбъекта КАК ТипОбъекта,
	|	Б24_К_ИдентификаторыДел.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыДел КАК Б24_К_ИдентификаторыДел
	|ГДЕ
	|	Б24_К_ИдентификаторыДел.Портал = &Портал
	|	И Б24_К_ИдентификаторыДел.ТипДанных = &ТипДанных
	|	И Б24_К_ИдентификаторыДел.Идентификатор = &Идентификатор";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда  
		
		Выборка = ВыполненныйЗапрос.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектСсылка  = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеПоИмениИИдентификатору(Выборка.ТипОбъекта, Выборка.ИдентификаторОбъекта); 
			
			Если ЗначениеЗаполнено(ОбъектСсылка) Тогда Результат.Добавить(ОбъектСсылка) КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИнформациюОДелахПоОбъекту(ОбъектСсылка, НастройкаПодключения = Неопределено, ТипВладельца = "", ИдентификаторВладельца = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Массив;    
	
	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипыДанных"			, Б24_К_RestApiВызовСервера.ПолучитьТипыДанныхДел());
	Запрос.УстановитьПараметр("ТипОбъекта"			, ОбъектСсылка.Метаданные().ПолноеИмя());
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", XMLСтрока(ОбъектСсылка));
	Запрос.Текст = "ВЫБРАТЬ
	|	Б24_К_ИдентификаторыДел.ТипОбъекта КАК ТипОбъекта,
	|	Б24_К_ИдентификаторыДел.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	|	Б24_К_ИдентификаторыДел.ТипДанных КАК ТипДанных,
	|	Б24_К_ИдентификаторыДел.Идентификатор КАК Идентификатор,
	|	Б24_К_НастройкиПодключения.Ссылка КАК НастройкаПодключения,
	|	Б24_К_ИдентификаторыДел.ДополнительныйИдентификатор КАК ДополнительныйИдентификатор,
	|	Б24_К_НастройкиПодключения.НеОбновлятьДелаБитрикс24 КАК НеОбновлятьДелаБитрикс24
	|ИЗ
	|	РегистрСведений.Б24_К_ИдентификаторыДел КАК Б24_К_ИдентификаторыДел
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б24_К_НастройкиПодключения КАК Б24_К_НастройкиПодключения
	|		ПО Б24_К_ИдентификаторыДел.Портал = Б24_К_НастройкиПодключения.Портал
	|ГДЕ
	|	Б24_К_ИдентификаторыДел.ТипОбъекта = &ТипОбъекта
	|	И Б24_К_ИдентификаторыДел.ИдентификаторОбъекта = &ИдентификаторОбъекта
	|	И Б24_К_ИдентификаторыДел.ТипДанных В(&ТипыДанных)
	|	И Б24_К_НастройкиПодключения.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовоеДело = Новый Структура;
		НовоеДело.Вставить("НастройкаПодключения"		, Выборка.НастройкаПодключения);
		НовоеДело.Вставить("НеОбновлятьДелаБитрикс24"	, Выборка.НеОбновлятьДелаБитрикс24);
		НовоеДело.Вставить("Объект"						, ОбъектСсылка);
		НовоеДело.Вставить("ИдентификаторВладельца"		, Выборка.ДополнительныйИдентификатор); 
		НовоеДело.Вставить("Идентификатор"				, Выборка.Идентификатор); 
		НовоеДело.Вставить("ТипВладельца"				, ""); 
		НовоеДело.Вставить("ЭтоНовый"					, Ложь); 
		
		Если ТипыДанныхДляОбменаСПорталом.ДелоСмартПроцесса = Выборка.ТипДанных Тогда
			ЧастиИдентификатора = СтрРазделить(Выборка.Идентификатор, "_");
			Если ЧастиИдентификатора.Количество() > 0 Тогда
				НовоеДело.ТипВладельца 	= ЧастиИдентификатора[0];	
			КонецЕсли;    
			Если ЧастиИдентификатора.Количество() > 1 Тогда
				НовоеДело.Идентификатор = ЧастиИдентификатора[1];    
			КонецЕсли;    
		Иначе
			НовоеДело.Идентификатор = Выборка.Идентификатор;    
			Если ЗначениеЗаполнено(ТипВладельца) Тогда
				НовоеДело.ТипВладельца = ТипВладельца;	
			Иначе
				НовоеДело.ТипВладельца = Б24_К_RestApiВызовСервера.ПолучитьТипВладельцаТаймЛайнПоТипуДанных(Выборка.ТипДанных);
			КонецЕсли;
		КонецЕсли; 
		
		Результат.Добавить(НовоеДело);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
